In [5]:
import numpy as np
import pandas as pd

wide_df1 = pd.read_csv("data/wide_data.csv")

In [6]:
wide_df1.head(5)

         date  tmax  tmin  tavg
0  2018-10-01  21.1   8.9  13.9
1  2018-10-02  23.9  13.9  17.2
2  2018-10-03  25.0  15.6  16.1
3  2018-10-04  22.8  11.7  11.7
4  2018-10-05  23.3  11.7  18.9

In [17]:
wide_df1.melt(
    id_vars = "date",
    var_name = "temp_type",
    value_name = "temp_type",
    value_vars = ["tmax", "tmin", "tavg"]).head(2)

         date temp_type temp_type
0  2018-10-01      tmax      tmax
1  2018-10-02      tmax      tmax

In [12]:
long_df1 = pd.read_csv("data/long_data.csv")
long_df1.head(5)

         date temp_type  temp_value
0  2018-10-01      tavg        13.9
1  2018-10-01      tmax        21.1
2  2018-10-01      tmin         8.9
3  2018-10-02      tavg        17.2
4  2018-10-02      tmax        23.9

In [11]:
long_df1.pivot(
    index = "date",
    columns = "temp_type",
    values ="temp_value").reset_index().tail(5)

temp_type        date  tavg  tmax  tmin
26         2018-10-27   6.1   8.9  -0.6
27         2018-10-28   7.2   8.3   5.0
28         2018-10-29   8.3  10.6   6.7
29         2018-10-30   5.0  13.3   2.2
30         2018-10-31   0.0  12.2   0.0

In [19]:
df = pd.read_excel("data/invoice_2011_07.xlsx")
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,559518,21989,PACK OF 20 SKULL PAPER NAPKINS,6,07/08/2011 16:11,1.63,NaN,United Kingdom
1,559518,22055,MINI CAKE STAND HANGING STRAWBERY,1,07/08/2011 16:11,3.29,NaN,United Kingdom

In [20]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [21]:
df["InvoiceDate"] = pd.to_datetime(df["InvoiceDate"])

In [26]:
df["revenue"] = df['UnitPrice'] * df['Quantity']
df.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,revenue
0,559518,21989,PACK OF 20 SKULL PAPER NAPKINS,6,2011-07-08 16:11:00,1.63,NaN,United Kingdom,9.78
1,559518,22055,MINI CAKE STAND HANGING STRAWBERY,1,2011-07-08 16:11:00,3.29,NaN,United Kingdom,3.29
2,559518,22179,SET 10 NIGHT OWL LIGHTS,1,2011-07-08 16:11:00,13.29,NaN,United Kingdom,13.29

In [30]:
top_5 = df.groupby("Country")["revenue"].sum().nlargest(5).copy()

In [32]:
top_5.to_csv("data/top5_by_country.csv")